# Завдання 7

Джерело датасету і матеріалів: https://github.com/justmarkham.

### 1. Імпортуйте потрібні бібліотеки

In [1]:
import pandas as pd

### 2. Імпортуйте датасет за цим [посиланням](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### 3. Призначте це змінній users.

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
users = pd.read_csv(url, sep="|")

In [3]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 4. Визначте середній вік за родом занять (occupation)

In [26]:
df = users[['age', 'occupation']].groupby('occupation')\
                                 .mean()\
                                 .reset_index()
df['age'] = df['age'].apply(lambda x: round(x, 1))
df

       occupation   age
0   administrator  38.7
1          artist  31.4
2          doctor  43.6
3        educator  42.0
4        engineer  36.4
5   entertainment  29.2
6       executive  38.7
7      healthcare  41.6
8       homemaker  32.6
9          lawyer  36.8
10      librarian  40.0
11      marketing  37.6
12           none  26.6
13          other  34.5
14     programmer  33.1
15        retired  63.1
16       salesman  35.7
17      scientist  35.5
18        student  22.1
19     technician  33.1
20         writer  36.3

### 5. Дізнайтеся про частку чоловіків за родом занять та відсортуйте це значення від найбільшого до найменшого

In [57]:
occ_gender_count = users.groupby(['occupation', 'gender'])\
                        .agg({'user_id': 'nunique'})\
                        .reset_index()\
                        .rename(columns={'user_id': 'count'})

In [58]:
occ_gender_total = occ_gender_count.groupby('occupation').sum()\
                                   .reset_index()\
                                   .rename(columns={'count': 'total'})

In [59]:
df = pd.merge(occ_gender_count, occ_gender_total, on="occupation")
df['ratio'] = (df['count'] / df['total'] * 100).apply(lambda x: round(x,2))

In [60]:
df[df['gender'] == 'M'][['occupation', 'ratio']].rename(columns={'ratio': 'ratio_male'})\
                                                .sort_values('ratio_male', ascending=False)\
                                                .reset_index(drop=True)

       occupation  ratio_male
0          doctor      100.00
1        engineer       97.01
2      technician       96.30
3         retired       92.86
4      programmer       90.91
5       executive       90.62
6       scientist       90.32
7   entertainment       88.89
8          lawyer       83.33
9        salesman       75.00
10       educator       72.63
11        student       69.39
12          other       65.71
13      marketing       61.54
14         writer       57.78
15           none       55.56
16  administrator       54.43
17         artist       53.57
18      librarian       43.14
19     healthcare       31.25
20      homemaker       14.29

### 6. Для кожної професії обчисліть найменший і найбільший вік, що зустрічається в датасеті

In [62]:
users.groupby('occupation').agg({'age': ['min', 'max']})

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70
entertainment  15  50
executive      22  69
healthcare     22  62
homemaker      20  50
lawyer         21  53
librarian      23  69
marketing      24  55
none           11  55
other          13  64
programmer     20  63
retired        51  73
salesman       18  66
scientist      23  55
student         7  42
technician     21  55
writer         18  60

### 7. Для кожної комбінації виду занять та статі обчисліть середній вік

In [71]:
df = users.groupby(['occupation', 'gender']).agg({'age': 'mean'})\
                                            .reset_index()\
                                            .rename(columns={'age': 'mean_age'})
df['mean_age'] = df['mean_age'].apply(lambda x: round(x, 1 ))

In [72]:
df

       occupation gender  mean_age
0   administrator      F      40.6
1   administrator      M      37.2
2          artist      F      30.3
3          artist      M      32.3
4          doctor      M      43.6
5        educator      F      39.1
6        educator      M      43.1
7        engineer      F      29.5
8        engineer      M      36.6
9   entertainment      F      31.0
10  entertainment      M      29.0
11      executive      F      44.0
12      executive      M      38.2
13     healthcare      F      39.8
14     healthcare      M      45.4
15      homemaker      F      34.2
16      homemaker      M      23.0
17         lawyer      F      39.5
18         lawyer      M      36.2
19      librarian      F      40.0
20      librarian      M      40.0
21      marketing      F      37.2
22      marketing      M      37.9
23           none      F      36.5
24           none      M      18.6
25          other      F      35.5
26          other      M      34.0
27     programmer      F      32.2
28     programmer      M      33.2
29        retired      F      70.0
30        retired      M      62.5
31       salesman      F      27.0
32       salesman      M      38.6
33      scientist      F      28.3
34      scientist      M      36.3
35        student      F      20.8
36        student      M      22.7
37     technician      F      38.0
38     technician      M      33.0
39         writer      F      37.6
40         writer      M      35.3

### 8. Для кожної професії відобразіть процент чоловіків і жінок в датасеті